app/controllers/api/books_controller.rb

    def index

        if params[:q] then

          @books = []
          Book.all.each { |book|
            if (book.title.downcase.include? params[:q].downcase) || (book.isbn.include? params[:q]) || (book.author.name.downcase.include? params[:q].downcase) then
---
SELECT "books".* FROM "books"
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]