app/models/user.rb

    def reset_session_token!
        self.update!(session_token: User.generate_session_token!)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "A3rTYrBtu33JshIYtEj7Dg"], ["updated_at", "2020-06-02 18:59:16.382143"], ["id", 4]]